#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
google_compute_network.vpc: Refreshing state... [id=projects/sandbox-environment-338017/global/networks/sandbox-environment-338017-vpc]
google_compute_subnetwork.subnet: Refreshing state... [id=projects/sandbox-environment-338017/regions/us-east1/subnetworks/sandbox-environment-338017-subnet]
google_container_cluster.primary: Refreshing state... [id=projects/sandbox-environment-338017/locations/us-east1/clusters/sandbox-environment-338017-gke]
google_container_node_pool.primary_nodes: Refreshing state... [id=projects/sandbox-environment-338017/locations/us-east1/clusters/sandbox-environment-338017-gke/nodePools/sandbox-environment-338017-gke-node-pool]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # google_container_cluster.primary has changed
  ~ resource "google_container_cluster" "primary" {
        id                          = "projects/sandbox-environment-338017/locations/us-east1/clusters/sandbox-environment-338017-gke"
        name                        = "sandbox-environment-338017-gke"
      + resource_labels             = {}
        # (24 unchanged attributes hidden)









        # (9 unchanged blocks hidden)
    }

  # google_container_node_pool.primary_nodes has been deleted
  - resource "google_container_node_pool" "primary_nodes" {
      - cluster        = "sandbox-environment-338017-gke" -> null
      - id             = "projects/sandbox-environment-338017/locations/us-east1/clusters/sandbox-environment-338017-gke/nodePools/sandbox-environment-338017-gke-node-pool" -> null
      - location       = "us-east1" -> null
      - name           = "sandbox-environment-338017-gke-node-pool" -> null
      - node_count     = 2 -> null
      - node_locations = [] -> null

      - node_config {
          - disk_size_gb      = 0 -> null
          - guest_accelerator = [] -> null
          - labels            = {
              - "env" = "sandbox-environment-338017"
            } -> null
          - local_ssd_count   = 0 -> null
          - machine_type      = "n1-standard-1" -> null
          - metadata          = {
              - "disable-legacy-endpoints" = "true"
            } -> null
          - oauth_scopes      = [
              - "https://www.googleapis.com/auth/logging.write",
              - "https://www.googleapis.com/auth/monitoring",
            ] -> null
          - preemptible       = false -> null
          - tags              = [
              - "gke-node",
              - "sandbox-environment-338017-gke",
            ] -> null
          - taint             = [] -> null
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_container_node_pool.primary_nodes will be created
  + resource "google_container_node_pool" "primary_nodes" {
      + cluster                     = "sandbox-environment-338017-gke"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "us-east1"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "sandbox-environment-338017-gke-node-pool"
      + name_prefix                 = (known after apply)
      + node_count                  = 1
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = (known after apply)
      + version                     = (known after apply)

      + management {
          + auto_repair  = (known after apply)
          + auto_upgrade = (known after apply)
        }

      + node_config {
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = {
              + "env" = "sandbox-environment-338017"
            }
          + local_ssd_count   = (known after apply)
          + machine_type      = "n1-standard-1"
          + metadata          = {
              + "disable-legacy-endpoints" = "true"
            }
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring",
            ]
          + preemptible       = false
          + service_account   = (known after apply)
          + tags              = [
              + "gke-node",
              + "sandbox-environment-338017-gke",
            ]
          + taint             = (known after apply)

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + mode = (known after apply)
            }
        }

      + upgrade_settings {
          + max_surge       = (known after apply)
          + max_unavailable = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @roopeshvs, Action: `pull_request`*